Repository: NaN-tic/trytond-product_measurements_shape
Catalog: locale/*.po
Languages: ca_es, es_es

# error:product.configuration:
source: Invalid formula %(formula)s %(error)s
ca_es: Fórmula no vàlida. %(formula)s %(error)s
es_es: Fórmula no válida. %(formula)s %(error)s

# error:product.measurements_shape_creation:
source: The product "%s" is not variant unique or does not have a code.
ca_es: El producte "%s" no és mono variant o no té un codi.
es_es: El producto "%s" no es mono variante o no tiene un código.

# field:product.configuration,density_volume_uom:
source: Density Volume UoM
ca_es: UdM del volum de la densitat
es_es: UdM del volumen de la densidad

# field:product.configuration,density_weight_uom:
source: Density Weight UoM
ca_es: UdM del pes de la densitat
es_es: UdM del peso de la densidad

# field:product.configuration,diameter_uom:
source: Diameter UoM
ca_es: UdM del diàmetre
es_es: UdM del diámetro

# field:product.configuration,height_uom:
source: Height UoM
ca_es: UdM de l'altura
es_es: UdM de la altura

# field:product.configuration,length_uom:
source: Length UoM
ca_es: UdM de la longitud
es_es: UdM de la longitud

# field:product.configuration,measurement_code_formula:
source: Measurement Code Formula
ca_es: Fórmula del codi de mesures
es_es: Fórmula del código de medidas

# field:product.configuration,shape:
source: Shape
ca_es: Forma
es_es: Forma

# field:product.configuration,weight_uom:
source: Weight UoM
ca_es: UdM del pes
es_es: UdM del peso

# field:product.configuration,width_uom:
source: Width UoM
ca_es: UdM de l'amplada
es_es: UdM del ancho

# field:product.measurements_shape_creation.ask,density:
source: Density
ca_es: Densitat
es_es: Densidad

# field:product.measurements_shape_creation.ask,density_digits:
source: Density Digits
ca_es: Decimals de la densitat
es_es: Decimales de la densidad

# field:product.measurements_shape_creation.ask,density_volume_uom:
source: Density Volume UoM
ca_es: UdM del volum de la densitat
es_es: UdM del volumen de la densidad

# field:product.measurements_shape_creation.ask,density_weight_uom:
source: Density Weight UoM
ca_es: UdM del pes de la densitat
es_es: UdM del peso de la densidad

# field:product.measurements_shape_creation.ask,diameter:
source: Diameter
ca_es: Diàmetre
es_es: Diámetro

# field:product.measurements_shape_creation.ask,diameter_digits:
source: Diameter Digits
ca_es: Decimals del diàmetre
es_es: Decimales del diámetro

# field:product.measurements_shape_creation.ask,diameter_uom:
source: Diameter UoM
ca_es: UdM del diàmetre
es_es: UdM del diámetro

# field:product.measurements_shape_creation.ask,height:
source: Height
ca_es: Altura
es_es: Altura

# field:product.measurements_shape_creation.ask,height_digits:
source: Height Digits
ca_es: Decimals de l'altura
es_es: Decimales de la altura

# field:product.measurements_shape_creation.ask,height_uom:
source: Height UoM
ca_es: UdM de l'altura
es_es: UdM de la altura

# field:product.measurements_shape_creation.ask,length:
source: Length
ca_es: Longitud
es_es: Longitud

# field:product.measurements_shape_creation.ask,length_digits:
source: Length Digits
ca_es: Decimals de la longitud
es_es: Decimales de la longitud

# field:product.measurements_shape_creation.ask,length_uom:
source: Length UoM
ca_es: UdM de la longitud
es_es: UdM de la longitud

# field:product.measurements_shape_creation.ask,shape:
source: Shape
ca_es: Forma
es_es: Forma

# field:product.measurements_shape_creation.ask,width:
source: Width
ca_es: Amplada
es_es: Ancho

# field:product.measurements_shape_creation.ask,width_digits:
source: Width Digits
ca_es: Decimals de l'amplada
es_es: Decimales del ancho

# field:product.measurements_shape_creation.ask,width_uom:
source: Width UoM
ca_es: UdM de l'amplada
es_es: UdM del ancho

# field:product.template,density:
source: Density
ca_es: Densitat
es_es: Densidad

# field:product.template,density_digits:
source: Density Digits
ca_es: Decimals de la densitat
es_es: Decimales de la densidad

# field:product.template,density_volume_uom:
source: Density Volume UoM
ca_es: UdM del volum de la densitat
es_es: UdM del volumen de la densidad

# field:product.template,density_weight_uom:
source: Density Weight UoM
ca_es: UdM del pes de la densitat
es_es: UdM del peso de la densidad

# field:product.template,diameter:
source: Diameter
ca_es: Diàmetre
es_es: Diámetro

# field:product.template,diameter_digits:
source: Diameter Digits
ca_es: Decimals del diàmetre
es_es: Decimales del diámetro

# field:product.template,diameter_uom:
source: Diameter UoM
ca_es: UdM del diàmetre
es_es: UdM del diámetro

# field:product.template,measurement_code:
source: Measurement code
ca_es: Codi de mesures
es_es: Código de medidas

# field:product.template,shape:
source: Shape
ca_es: Forma
es_es: Forma

# help:product.configuration,density_volume_uom:
source: Default value of the Density Volume UoM field in template form.
ca_es: Valor per defecte del camp UdM del volum de la densitat en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM del volumen de la densidad en el formulario de la plantilla de producto.

# help:product.configuration,density_weight_uom:
source: Default value of the Density Weight UoM field in template form.
ca_es: Valor per defecte del camp UdM del pes de la densitat en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM del peso de la densidad en el formulario de la plantilla de producto.

# help:product.configuration,diameter_uom:
source: Default value of the Diameter UoM field in template form.
ca_es: Valor per defecte del camp UdM del diàmetre en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM del diámetro en el formulario de la plantilla de producto.

# help:product.configuration,height_uom:
source: Default value of the Height UoM field in template form.
ca_es: Valor per defecte del camp UdM de l'altura en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM de la altura en el formulario de la plantilla de producto.

# help:product.configuration,length_uom:
source: Default value of the Length UoM field in template form.
ca_es: Valor per defecte del camp UdM de la longitud en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM de la longitud en el formulario de la plantilla de producto.

# help:product.configuration,measurement_code_formula:
source: Python expression to compute the code from measurements. It can use the following product template fields: type, shape, length, length_uom, height, height_uom, width, width_uom, diameter, diameter_uom, weight, weight_uom, density, density_weight_uom, density_volume_uom
ca_es: Expressió Python per calcular el codi de mesures. Podeu utilitzar els següents camps de la plantilla de producte: type, shape, length, length_uom, height, height_uom, width, width_uom, diameter, diameter_uom, weight, weight_uom, density, density_weight_uom, density_volume_uom
es_es: Expresión Python para calcular el código de medidas. Puede usar los siguientes campos de la plantilla de producto: type, shape, length, length_uom, height, height_uom, width, width_uom, diameter, diameter_uom, weight, weight_uom, density, density_weight_uom, density_volume_uom

# help:product.configuration,shape:
source: Default value of the shape field in template form.
ca_es: Valor per defecte del camp UdM de la forma en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM de la forma en el formulario de la plantilla de producto.

# help:product.configuration,weight_uom:
source: Default value of the Weight UoM field in template form.
ca_es: Valor per defecte del camp UdM del pes en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM del peso en el formulario de la plantilla de producto.

# help:product.configuration,width_uom:
source: Default value of the Width UoM field in template form.
ca_es: Valor per defecte del camp UdM de l'amplada en el formulari de la plantilla de producte.
es_es: Valor por defecto del campo UdM de la anchura en el formulario de la plantilla de producto.

# help:product.template,shape:
source: Weight Formula for Parallelepiped = width*height*length*density Weight Formula for Cylinder = (diameter/2)^2*pi*length*density
ca_es: Fórmula del pes pel paral·lelepípede = amplada * alçada * longitud * densitat Fórmula del pes pel cilindre = (diàmetre/2)^2 * pi * longitud * densitat
es_es: Fórmula del peso para el paralelepípedo = anchura * altura * longitud * densidad Fórmula del peso para el cilindro = (diámetro/2)^2 * pi * longitud * densidad

# model:ir.action,name:wizard_product_measurements_shape_creation
source: Create/Find product with same code and different shape/measurements
ca_es: Crea/Cerca producte amb el mateix codi i diferent forma/mesures
es_es: Crear/Buscar producto con el mismo código y distinta forma/medidas

# model:ir.action,name:wizard_product_template_measurements_shape_creation
source: Create/Find product with same code and different shape/measurements
ca_es: Crea/Cerca producte amb el mateix codi i diferent forma/mesures
es_es: Crear/Buscar producto con el mismo código y distinta forma/medidas

# model:product.measurements_shape_creation.ask,name:
source: Product Measurements Shape Creation Ask
ca_es: Pregunta creació producte amb forma/mesures
es_es: Pregunta creación producto con forma/medidas

# selection:product.configuration,shape:
source: Cylinder
ca_es: Cilindre
es_es: Cilindro

# selection:product.configuration,shape:
source: None
ca_es: Cap
es_es: Ninguna

# selection:product.configuration,shape:
source: Parallelepiped
ca_es: Paral·lelepípede
es_es: Paralelepípedo

# selection:product.measurements_shape_creation.ask,shape:
source: Cylinder
ca_es: Cilindre
es_es: Cilindro

# selection:product.measurements_shape_creation.ask,shape:
source: None
ca_es: Cap
es_es: Ninguna

# selection:product.measurements_shape_creation.ask,shape:
source: Parallelepiped
ca_es: Paral·lelepípede
es_es: Paralelepípedo

# selection:product.template,shape:
source: Cylinder
ca_es: Cilindre
es_es: Cilindro

# selection:product.template,shape:
source: None
ca_es: Cap
es_es: Ninguna

# selection:product.template,shape:
source: Parallelepiped
ca_es: Paral·lelepípede
es_es: Paralelepípedo

# view:product.measurements_shape_creation.ask:
source: Create/Find product with shape/measurements
ca_es: Crea/Cerca producte amb forma/mesures
es_es: Crear/Buscar producto con forma/medidas

# wizard_button:product.measurements_shape_creation,start,create_:
source: Create/Find
ca_es: Crea/Cerca
es_es: Crear/Buscar

# wizard_button:product.measurements_shape_creation,start,end:
source: Cancel
ca_es: Cancel·la
es_es: Cancelar
